---
title: ImageType
classe: Autodesk.Revit.DB.ImageType
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.ElementType
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 16
---

# ImageType

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `ExternalResourceType ExternalResourceType { get; }` | `ImageType.ExternalResourceType` | ExternalResourceType |
| `Double Height { get; }` | `imageType.Height` | Double |
| `Int32 HeightInPixels { get; }` | `imageType.HeightInPixels` | Int32 |
| `Int32 PageNumber { get; }` | `imageType.PageNumber` | Int32 |
| `String Path { get; }` | `imageType.Path` | String |
| `PathType PathType { get; }` | `imageType.PathType` | PathType |
| `Double Resolution { get; }` | `imageType.Resolution` | Double |
| `ImageTypeSource Source { get; }` | `imageType.Source` | ImageTypeSource |
| `ImageTypeStatus Status { get; }` | `imageType.Status` | ImageTypeStatus |
| `Double Width { get; }` | `imageType.Width` | Double |
| `Int32 WidthInPixels { get; }` | `imageType.WidthInPixels` | Int32 |
| `Boolean CanReload()` | `imageType.CanReload()` | Boolean |
| `ImageType Create(Document, ImageTypeOptions)` | `ImageType.Create(document, options)` | ImageType |
| `Void Reload()` | `imageType.Reload()` | Void |
| `Void ReloadFrom(ImageTypeOptions)` | `imageType.ReloadFrom(options)` | Void |
| `Void Unload()` | `imageType.Unload()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```